{
  "data": [
    {
      "name": "This Website",
      "date": "2023, February",
      "description": "What started out as a passing thought towards the end of my degree eventually snowballed into a fun but challenging demonstration of my abilities. After many months of working on this project on the side, I finally had enough to release the very first version of my personal portfolio in February 2023. I will continue to update the site to spice things up whenever I see fit.",
      "imgUrl": "/assets/project-images/meta.png",
      "links": [
        {
          "name": "GitHub",
          "href": "https://github.com/benpaulsen4/project-narcissism"
        }
      ],
      "tags": ["TS", "NextJS", "Railway", "Firebase"]
    },
    {
      "name": "Youtube Stats Collector",
      "date": "2023, January",
      "description": "As somewhat of a data science nerd myself, and a major fan of many Youtube creators, this was a perfect opportunity to try out something new. In the span of 2 Sunday afternoons, I created a highly configurable application which could regularly collect subscriber counts of selected creators and provide analytics demonstrating their relative performance.",
      "imgUrl": "/assets/project-images/yt-stats.png",
      "links": [
        {
          "name": "GitHub",
          "href": "https://github.com/benpaulsen4/YoutubeStats"
        }
      ],
      "tags": ["C#", ".NET Console", "Youtube API v3", "ScottPlot"]
    },
    {
      "name": "Tanda JobHub",
      "date": "2022, September",
      "description": "In the final year of my degree, I was partnered with real-world organization Tanda to construct a solution for them as part of a team. JobHub is a job listing site focused on short-term flexible work, allowing employees of consenting organizations to work temporary positions in other parts of the organization or even in other partner organizations entirely. For this project we were awarded a grade of 95% - reflecting our excellent fit of the polished project to Tanda's needs.",
      "imgUrl": "/assets/project-images/tjobhub.png",
      "links": [
        {
          "name": "Deployed Version (By request)",
          "href": "https://tandajobhub-qut.up.railway.app/"
        },
        {
          "name": "Tanda Website",
          "href": "https://www.tanda.co/"
        }
      ],
      "tags": ["C#", "ASP.Net", "MongoDB", "Docker"]
    },
    {
      "name": "Web Spider",
      "date": "2022, August",
      "description": "My first experimental home project, Web Spider is a simple web crawler that demonstrates on a high level how a search engine crawler works. It is even multi-threaded to allow for a greater throughput of web request creation and processing.",
      "imgUrl": "/assets/project-images/webspider.png",
      "links": [
        {
          "name": "GitHub (Coming soon)",
          "href": ""
        }
      ],
      "tags": ["C#", ".NET Console", "HTML Agility Pack"]
    },
    {
      "name": "REX NOC Comment Portal",
      "date": "2022, July",
      "description": "As part of my short time at REX, I was tasked with developing a beta solution to submitting comments to a database so that they could be read in a PowerBI dashboard. This was my first non-university web project.",
      "imgUrl": "/assets/project-images/nocportal.png",
      "links": [
        {
          "name": "GitHub",
          "href": "https://github.com/benpaulsen4/REX-NOC-Comments-Portal"
        },
        {
          "name": "REX Website",
          "href": "https://rexenergy.com.au"
        }
      ],
      "tags": ["JS", "React", "Express", "MSSQL"]
    }
  ]
}
